Repository: riandeoliveira/task-list-api
Catalog: src/TodoList/Resources/Messages.*.resx
Languages: pt_br

# EmailIsValid
source: The email must be valid.
pt_br: O e-mail deve ser válido.

# EquivalentPasswords
source: The passwords must be equivalent.
pt_br: As senhas devem ser equivalentes.

# FieldIsRequired
source: The field is required.
pt_br: O campo é obrigatório.

# FieldLengthBetween
source: The field must be between {0} and {1} characters long.
pt_br: O campo deve ter entre {0} e {1} caracteres.

# FieldMaxLength
source: The field must be at most {0} characters long.
pt_br: O campo deve ter no máximo {0} caracteres.

# InvalidCredentials
source: The credentials are invalid.
pt_br: As credenciais são inválidas.

source: Password reset request
pt_br: Solicitação de redefinição de senha

source: Todo not found.
pt_br: Tarefa não encontrada.

# TooManyRequests
source: Too many requests. Please try again later.
pt_br: Muitas solicitações. Tente novamente mais tarde.

# UnauthorizedOperation
source: You do not have permission to perform this action.
pt_br: Você não possui permissão para realizar esta ação.

# UnexpectedRequestError
source: An error occurred while processing your request.
pt_br: Um erro ocorreu ao processar sua solicitação.

# UserAlreadyExists
source: This user already exists.
pt_br: Este usuário já existe.

# UsernameIsValid
source: The field must only contain letters, numbers, underscore, dot, and hyphen.
pt_br: O campo deve conter apenas letras, números, sublinhado, ponto e hífen.

source: User not found.
pt_br: Usuário não encontrado.
